# CorruptModelException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorruptModelException Class
Members See Also
---
The exception that is thrown when the model is or seems corrupt.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class CorruptModelException : ApplicationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class CorruptModelException _
	Inherits ApplicationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class CorruptModelException : public ApplicationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..CorruptModelException
# See Also
CorruptModelException Members
Autodesk.Revit.Exceptions Namespace